Repository: ma115a/HospitalManagementSystemHCI
Catalog: HospitalManagementSystem/Resources/Main.*.resx
Languages: de, sr

# loginBtn
source: Login
de: Einloggen
sr: Uloguj se

# usernameBox
source: Username
de: Benutzername
sr: Коrisničko ime

# passwordBox
source: Password
de: Passwort
sr: Lozinka

# adminTitle
source: Administrator Console
de: Administratorkonsole
sr: Admin panel

# adminManageProfilesContent
source: Create and manage Nurses, Surgeons, Doctors, Lab Workers and Administrators.
de: Erstellen und verwalten Sie Krankenschwestern, Chirurgen, Ärzte, Labormitarbeiter und Administratoren.
sr: Kreirajte i upravljajte medicinskim sestrama, hirurzima, doktorima, laboratorijskim radnicima i administratorima.

# adminManageProfilesTitle
source: Manage User Profiles
de: Benutzerprofile verwalten
sr: Upravljaj korisničkim nalozima

# adminDepartmentsTitle
source: Departments and Rooms
de: Abteilungen und Räume
sr: Odjeljenja i sobe

# adminDepartmentsContent
source: Create departments, assign rooms and manage capacities.
de: Abteilungen anlegen, Räume zuordnen und Kapazitäten verwalten.
sr: Kreirajte odjele, dodijelite sobe i upravljajte kapacitetima.

# adminVehiclesTitle
source: Vehicles
de: Fahrzeuge
sr: Vozila

# adminVehiclesContent
source: Register and maintain ambulances and other vehicles.
de: Krankenwagen und andere Fahrzeuge registrieren und warten.
sr: Registrujte i održavajte ambulantna i druga vozila.

# adminCardButton
source: Open
de: Offen
sr: Otvori

# adminMedicationsTitle
source: Medications Inventory
de: Medikamenteninventar
sr: Inventar lijekova

# adminMedicationsContent
source: Manage drug catalog and stock across departments.
de: Verwalten Sie den Medikamentenkatalog und den Lagerbestand abteilungsübergreifend.
sr: Upravljajte katalogom lijekova i zalihama u svim odjeljenjima.

source: Back to Dashboard
de: Zurück zum Dashboard
sr: Povratak na kontrolnu tablu

# newBtn
source: New
de: Neu
sr: Novo

# editBtn
source: Edit
de: Bearbeiten
sr: Uredi

# deleteBtn
source: Delete
de: Löschen
sr: Izbriši

source: Users
de: Benutzer
sr: Korisnici

# usernameGrid
source: Username
de: Benutzername
sr: Korisničko ime

# nameGrid
source: Name
sr: Ime

# roleGrid
source: Role
de: Rolle
sr: Uloga

# activeGrid
source: Active
de: Aktiv
sr: Aktivan

source: User Details
de: Benutzerdetails
sr: Detalji o korisniku

source: Full name
de: Vollständiger Name
sr: Puno ime

# departmentBox
source: Department (optional)
de: Abteilung (optional)
sr: Odjel (opciono)

# phoneBox
source: Phone
de: Telefon
sr: Telefon

# notesBox
source: Notes
de: Notizen
sr: Bilješke

# saveBtn
source: Save
de: Speichern
sr: Sačuvaj

# vehiclesTitle
source: Vehicles
de: Fahrzeuge
sr: Vozila

# plateGrid
source: Plate
de: Kennenzeichen
sr: Tablice

# brandGrid
source: Brand
de: Marke
sr: Marka

# cancelBtn
source: Cancel
de: Stornieren
sr: Otkaži

# lastServiceGrid
source: Last Service
de: Letzter Dienst
sr: Zadnji servis

source: Vehicle Details
de: Fahrzeugdetails
sr: Detalji o vozilu

# newDepartmentBtn
source: New Department
de: Neue Abteilung
sr: Novo Odjeljenje

# departmentsTitle
source: Departments
de: Abteilungen
sr: Odeljenja

# codeGrid
source: Code
sr: Kod

# headGrid
source: Head
de: Haupt
sr: Šef

# roomsGrid
source: Rooms
de: Zimmer
sr: Sobe

# numberGrid
source: Number
de: Nummer
sr: Broj

# newRoomBtn
source: New Room
de: Neues Zimmer
sr: Nova Soba

# capacityGrid
source: Capacity
de: Kapazität
sr: Kapacitet

# typeGrid
source: Type
de: Typ
sr: Tip

source: Create Department
de: Abteilung erstellen
sr: Kreiraj odjeljenje

# departmentNameBox
source: Department Name
de: Abteilungsname
sr: Naziv odjela

source: Head of department
de: Abteilungsleiter
sr: Šef odjeljenja

source: Create Room
de: Raum schaffen
sr: Kreiraj sobu

source: Department
de: Abteilung
sr: Odjel

source: Room number
de: Zimmernummer
sr: Broj sobe

source: Current patients (optional)
de: Aktuelle Patienten (optional)
sr: Trenutni pacijenti (opciono)

# doctorTitle
source: Doctor Console
de: Arztkonsole
sr: Doktor panel

# searchPatient
source: Search patient (name)
de: Suche Patient (Name)
sr: Pretraži pacijenta (ime)

# patientUmcn
source: UMCN:
de: Identifikationsnummer
sr: JMBG

# patientName
source: Name:
sr: Ime:

# patientPhone
source: Phone:
de: Telefon nummer:
sr: Broj telefona:

# doctorMedicalRecordsTitle
source: View Medical Records
de: Krankenakten anzeigen
sr: Pogledaj medicisnki karton

# doctorMedicalRecordsContent
source: Browse and view patient medical records.
de: Durchsuchen und zeigen Sie die Krankenakten von Patienten an.
sr: Pregledajte i pregledajte medicinske kartone pacijenata.

# doctorPrescriptionTitle
source: Make Prescription
de: Machen Sie ein Rezept
sr: Napravite recept

# doctorPrescriptionContent
source: Create a new prescription for a patient.
de: Erstellen Sie ein neues Rezept für einen Patienten.
sr: Kreirajte novi recept za pacijenta.

# doctorLaboratoryTitle
source: Laboratory results
de: Laborergebnisse
sr: Laboratorijski rezultati

# doctorLaboratoryContent
source: Review completed lab test results.
de: Überprüfen Sie die Ergebnisse der abgeschlossenen Labortests.
sr: Pregledajte rezultate završenih laboratorijskih testova.

# doctorAdmissionTitle
source: Make Admission
de: Machen Sie Einlass
sr: Zaprimi pacijenta

# doctorAdmissionContent
source: Admit a patient to a room.
de: Nehmen Sie einen Patienten in ein Zimmer auf.
sr: Primite pacijenta u sobu.

# doctorSurgeriesTitle
source: View surgeries
de: Operationen ansehen
sr: Pogledajte operacije

# doctorSurgeriesContent
source: See past and scheduled surgeries.
de: Sehen Sie sich vergangene und geplante Operationen an.
sr: Pogledajte prošle i zakazane operacije.

# doctorLaboratorySearch
source: Search requests
de: Suchanfragen
sr: Zahtjevi za pretraživanje

source: From date
de: Ab Datum
sr: Od datuma

source: To date
de: Bis datum
sr: Do datuma

source: Requests
de: Anfragen
sr: Zahtjevi

source: Lab Requests
de: Laboranfragen
sr: Zahtjevi

source: Date
de: Datum
sr: Datum

source: Patient
sr: Pacijent

source: Doctor
de: Arzt
sr: Doktor

source: Nurse
de: Krankenschwester
sr: Medicinska sestra

source: Lab Tehnician
de: Labortechniker
sr: Laborant

source: Test name
sr: Naziv testa

# clinicalReason
source: Clinical information / Reason
de: Klinische Informationen / Grund
sr: Kliničke informacije / Razlog

source: Results
de: Ergebnisse
sr: Rezultati

source: Request Details
de: Details anfordern
sr: Detalji zahtjeva

source: Lab Results
de: Laborergebnisse
sr: Rezultati

source: Result Details
de: Ergebnisdetails
sr: Detalji rezultata

source: Result data
de: Ergebnisdaten
sr: Podaci o rezultatu

source: All statuses
de: Alle Status
sr: Svi statusi

source: Rooms
de: Zimmer
sr: Sobe

source: Room
de: Zimmer
sr: Soba

# admissionsForRoom
source: Admissions for selected room
de: AdEintritte für ausgewählte Zimmermissions for selected room
sr: Prijemi za odabranu sobu

source: Admitted
de: Zugegeben
sr: Primljen

source: Admission
de: Zulassung
sr: Prijem

source: Admit date
de: Aufnahmedatum
sr: Datum primanja

source: Expected discharge
de: Erwartete Entlassung
sr: Očekivano otpuštanje

source: Search records
de: Datensätze durchsuchen
sr: Pretražite zapise

source: Medical Records
de: Krankenakten
sr: Medicinski zapisi

source: Record Details
de: Details aufzeichnen
sr: Detalji

source: Diagnosis
de: Diagnose
sr: Dijagnoza

source: Treatment
de: Behandlung
sr: Tretman

source: Search prescriptions
de: Suchen Sie nach Rezepten
sr: Pretražite recepte

source: Prescriptions
de: Rezepte
sr: Recepti

source: Medication
de: Medikamente
sr: Lijekovi

source: Dosage
de: Dosierung
sr: Doziranje

source: New Prescription
de: Neues Rezept
sr: Novi Recept

source: Frequency
de: Frequenz
sr: Frekvencija

source: Duration
de: Dauer
sr: Trajanje

source: Refills
de: Nachfüllungen
sr: Dopunjavanje

# searchSurgeries
source: Search surgeries (by procedure)
de: Suche nach Operationen (nach Verfahren)
sr: Pretraživanje operacija (po postupku)

source: Status
de: Operationen
sr: Operacije

source: Surgeon
de: Chirurg
sr: Hirurg

source: Procedure
de: Prozedur
sr: Procedura

source: Schedule Surgery
de: Planen Sie eine Operation
sr: Planirajte operaciju

source: Duration (min)
de: Dauer (min)
sr: Trajanje (min)

source: Nurses
de: Krankenschwestern
sr: Medicinske sestre

source: Select nurses…
de: Wählen Sie Krankenschwestern aus…
sr: Odaberite medicinske sestre…

source: Pick Nurses
de: Wählen Sie Krankenschwestern
sr: Izaberite medicinske sestre

source: Search nurses
de: Suche Krankenschwestern
sr: Tražite medicinske sestre

# laboratoryTitle
source: Laboratory Console
de: Laborkonsole
sr: Laboratorijski panel

source: Requested
de: Angefordert
sr: Zatraženo

source: Surgeries
de: Operationen
sr: Operacije

source: Requests Queue
de: Anforderungswarteschlange
sr: Zahtjevi

# requestQueueContent
source: See pending test orders and start processing.
de: Sehen Sie sich ausstehende Testaufträge an und beginnen Sie mit der Bearbeitung.
sr: Pogledajte narudžbe za testiranje koje čekaju i započnite obradu.

source: Enter Results
de: Geben Sie Ergebnisse ein
sr: Unesite rezultate

# enterResultsContent
source: Pick a request and record results.
de: Wählen Sie eine Anfrage aus und zeichnen Sie die Ergebnisse auf.
sr: Odaberite zahtjev i zabilježite rezultate.

source: Results History
de: Ergebnisverlauf
sr: Istorija rezultata

# resultHistoryContent
source: Search and view past results.
de: Suchen und zeigen Sie frühere Ergebnisse an.
sr: Pretražite i pogledajte prethodne rezultate.

source: Pending Requests
de: Ausstehende Anfragen
sr: Zahtjevi na čekanju

source: Start test
de: Test starten
sr: Pokreni test

source: Complete
de: Vollständig
sr: Završeno

source: Select request
de: Anfrage auswählen
sr: Odaberite zahtjev

# time
source: Time (HH:mm)
de: Zeit (HH:mm)
sr: Vrijeme (HH:mm)

source: Discharged
de: Entladen
sr: Otpušten

source: Appointments
de: Termine
sr: Termini

source: Appointment Details
de: Termindetails
sr: Detalji zakazivanja

# appointmentsContent
source: View/manage daily schedules and update status.
de: Tagespläne anzeigen/verwalten und Status aktualisieren.
sr: Pregledajte/upravljajte dnevnim rasporedima i ažurirajte status.

source: Schedule Appointment
de: Termin vereinbaren
sr: Zakažite termin

# scheduleAppointmentContent
source: Create a new appointment for a patient.
de: Erstellen Sie einen neuen Termin für einen Patienten.
sr: Kreirajte novi termin za pacijenta.

source: Admissions and Beds
de: Aufnahmen und Betten
sr: Prijemi i kreveti

# admissionsAndBedsContent
source: Admit/discharge patients and track room occupancy.
de: Patienten aufnehmen/entlassen und Zimmerbelegung verfolgen.
sr: Prijem/otpust pacijenata i praćenje popunjenosti soba.

# labReqRes
source: Lab (Requests and Results)
de: Labor (Anfragen und Ergebnisse)
sr: Laboratorija (Zahtjevi i rezultati)

# labReqResContent
source: Create lab requests and follow results.
de: Erstellen Sie Laboranfragen und verfolgen Sie die Ergebnisse.
sr: Kreirajte laboratorijske zahtjeve i pratite rezultate.

# surgeriesContent
source: See schedule and assign circulating/scrub nurses.
de: Sehen Sie sich den Dienstplan an und weisen Sie die umhergehenden/operativen Pflegekräfte zu.
sr: Pogledajte raspored i odredite dežurne/zamjenske medicinske sestre.

source: Patients
de: Patienten
sr: Pacijenti

# patientsContent
source: Create/edit patient demographics.
de: Erstellen/Bearbeiten Sie demografische Patientendaten.
sr: Kreirajte/uredite demografske podatke pacijenata.

source: UMCN
de: Identifikationsnummer
sr: JMBG

source: Phone
de: Telefonnummer
sr: Broj telefona

source: Patient Details
de: Patientendaten
sr: Detalji o pacijentu

source: Surgery Details
de: Details zur Operation
sr: Detalji o operaciji

# nurseTitle
source: Nurse console
de: Nurse consoleSchwesternkonsole
sr: Medicinska sestra panel

source: My Surgeries
de: Meine Operationen
sr: Moje operacije

# mySurgeriesContent
source: Review and edit upcoming cases; manage team checklists.
de: Überprüfen und bearbeiten Sie anstehende Fälle; verwalten Sie Team-Checklisten.
sr: Pregledajte i uredite predstojeće slučajeve; upravljajte kontrolnim listama tima.

# scheduleSurgeryContent
source: Create a new case with patient, OR, and timing.
de: Erstellen Sie einen neuen Fall mit Patient, OP und Zeitpunkt.
sr: Kreirajte novi slučaj s pacijentom, operacionom salom i vremenom.

source: Surgery History
de: Geschichte der Operation
sr: Hirurška istorija

# surgeryHistoryContent
source: Browse past cases and post-op outcomes.
de: Durchsuchen Sie frühere Fälle und postoperative Ergebnisse.
sr: Pregledajte prošle slučajeve i postoperativne ishode.

source: Team
sr: Tim

source: Assign Nurses
de: Weisen Sie Krankenschwestern zu
sr: Dodijelite medicinske sestre

source: Available nurses
de: Verfügbare Krankenschwestern
sr: Dostupne medicinske sestre

source: Assign
de: Zuordnen
sr: Dodijeli

source: Remove
de: Entfernen
sr: Ukloni

# surgeonTitle
source: Surgeon Console
de: Chirurgenkonsole
sr: Hirurg panel

source: Details
sr: Detalji

source: Assigned nurses
de: Zugewiesene Krankenschwestern
sr: Dodijeljene medicinske sestre

source: Notes
de: Notizen
sr: Bilješke

source: Request Laboratory
de: Labor anfordern
sr: Zatraži laboratoriju

# requestLaboratoryContent
source: Order lab tests and track their status.
de: Bestellen Sie Labortests und verfolgen Sie deren Status.
sr: Naručite laboratorijske testove i pratite njihov status.

# userDoesNotExist
source: Username does not exist!
de: Benutzername existiert nicht!
sr: Korisničko ime ne postoji!

# invalidPassword
source: Invalid pasword!
de: Ungültiges Passwort!
sr: Nevažeća lozinka!

# patientError
source: Please select a patient.
de: Bitte wählen Sie einen Patienten aus.
sr: Molimo odaberite pacijenta.

# medicalRecordError
source: Please select a medical record.
de: Bitte wählen Sie eine Krankenakte aus.
sr: Molimo odaberite medicinski karton.

# dateError
source: Please select a date.
de: Bitte wählen Sie ein Datum aus.
sr: Molimo odaberite datum.

# timeError
source: Please select a time.
de: Bitte wählen Sie eine Uhrzeit aus.
sr: Molimo odaberite vrijeme.

# laboratoryTestError
source: Please select a test.
de: Bitte wählen Sie einen Test aus.
sr: Molimo odaberite test.

# laboratoryTechnicianError
source: Please select a lab worker.
de: Bitte wählen Sie einen Labormitarbeiter aus.
sr: Molimo odaberite laboratorijskog radnika.

# roomError
source: Please select a room.
de: Bitte wählen Sie ein Zimmer aus.
sr: Molimo odaberite sobu.

# admissionError
source: Please select an admission.
de: Bitte wählen Sie eine Zulassung aus.
sr: Molimo odaberite upis.

# prescriptionError
source: Please select a prescription.
de: Bitte wählen Sie ein Rezept aus.
sr: Molimo odaberite recept.

# medicationError
source: Please select medication.
de: Bitte Medikament auswählen.
sr: Molimo odaberite lijek.

# surgeryError
source: Please select a surgery.
de: Bitte wählen Sie eine Operation.
sr: Molimo odaberite operaciju.

# appointmentError
source: Please select an appointment.
de: Bitte wählen Sie einen Termin aus.
sr: Molimo odaberite termin.

# patientUmcnError
source: Umcn must be 13 characters logn.
de: Identifikationsnummer muss 13 Zeichen lang sein.
sr: JMBG mora biti 13 karaktera,

# patientUmcnLetterError
source: Umcn needs to contain only letters.
de: Identifikationsnummer darf nur Buchstaben enthalten
sr: JMBG mora sadržati samo brojeve.

# doctorError
source: Please select a doctor.
de: Bitte wählen Sie einen Arzt aus.
sr: Umcn treba da sadrži samo slova.

# nurseError
source: Please select a nurse.
de: Bitte wählen Sie eine Pflegekraft aus.
sr: Molimo odaberite medicinsku sestru.

# nameError
source: Please enter a name.
de: Bitte geben Sie einen Namen ein.
sr: Molimo unesite ime.

# userExists
source: Username already exists.
de: Der Benutzername ist bereits vorhanden.
sr: Korisničko ime već postoji.

source: Test Started
de: Test gestartet
sr: Test pokrenut

source: Surgery department
de: Chirurgische Abteilung
sr: Operaciono odjeljenje
